MikroElektronika/core_packages/PIC/XC8/def/PIC18F46Q43/mcu.h
extern volatile U5RXPPSbits_t U5RXPPSbits __at(0x27A);
// bitfield macros
#define _U5RXPPS_PIN_POSN                                   0x0
#define _U5RXPPS_PIN_POSITION                               0x0
#define _U5RXPPS_PIN_SIZE                                   0x3
#define _U5RXPPS_PIN_LENGTH                                 0x3
#define _U5RXPPS_PIN_MASK                                   0x7
#define _U5RXPPS_PORT_POSN                                  0x3
#define _U5RXPPS_PORT_POSITION                              0x3
#define _U5RXPPS_PORT_SIZE                                  0x3
#define _U5RXPPS_PORT_LENGTH                                0x3
#define _U5RXPPS_PORT_MASK                                  0x38
#define _U5RXPPS_U5RXPPS_POSN                               0x0
#define _U5RXPPS_U5RXPPS_POSITION                           0x0
#define _U5RXPPS_U5RXPPS_SIZE                               0x6
#define _U5RXPPS_U5RXPPS_LENGTH                             0x6
#define _U5RXPPS_U5RXPPS_MASK                               0x3F
#define _U5RXPPS_U5RXPPS0_POSN                              0x0
#define _U5RXPPS_U5RXPPS0_POSITION                          0x0
#define _U5RXPPS_U5RXPPS0_SIZE                              0x1
#define _U5RXPPS_U5RXPPS0_LENGTH                            0x1
#define _U5RXPPS_U5RXPPS0_MASK                              0x1
#define _U5RXPPS_U5RXPPS1_POSN                              0x1
#define _U5RXPPS_U5RXPPS1_POSITION                          0x1
#define _U5RXPPS_U5RXPPS1_SIZE                              0x1
#define _U5RXPPS_U5RXPPS1_LENGTH                            0x1
#define _U5RXPPS_U5RXPPS1_MASK                              0x2
#define _U5RXPPS_U5RXPPS2_POSN                              0x2
#define _U5RXPPS_U5RXPPS2_POSITION                          0x2
#define _U5RXPPS_U5RXPPS2_SIZE                              0x1
#define _U5RXPPS_U5RXPPS2_LENGTH                            0x1
#define _U5RXPPS_U5RXPPS2_MASK                              0x4
#define _U5RXPPS_U5RXPPS3_POSN                              0x3
#define _U5RXPPS_U5RXPPS3_POSITION                          0x3
#define _U5RXPPS_U5RXPPS3_SIZE                              0x1
#define _U5RXPPS_U5RXPPS3_LENGTH                            0x1
#define _U5RXPPS_U5RXPPS3_MASK                              0x8
#define _U5RXPPS_U5RXPPS4_POSN                              0x4
#define _U5RXPPS_U5RXPPS4_POSITION                          0x4
#define _U5RXPPS_U5RXPPS4_SIZE                              0x1
#define _U5RXPPS_U5RXPPS4_LENGTH                            0x1
#define _U5RXPPS_U5RXPPS4_MASK                              0x10
#define _U5RXPPS_U5RXPPS5_POSN                              0x5
#define _U5RXPPS_U5RXPPS5_POSITION                          0x5
#define _U5RXPPS_U5RXPPS5_SIZE                              0x1
#define _U5RXPPS_U5RXPPS5_LENGTH                            0x1
#define _U5RXPPS_U5RXPPS5_MASK                              0x20

// Register: U5CTSPPS
#define U5CTSPPS U5CTSPPS
extern volatile unsigned char           U5CTSPPS            __at(0x27B);
#ifndef _LIB_BUILD
asm("U5CTSPPS equ 027Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U5CTSPPS               :6;
    };
    struct {
        unsigned U5CTSPPS0              :1;
        unsigned U5CTSPPS1              :1;
        unsigned U5CTSPPS2              :1;
        unsigned U5CTSPPS3              :1;
        unsigned U5CTSPPS4              :1;
        unsigned U5CTSPPS5              :1;
    };
} U5CTSPPSbits_t;
extern volatile U5CTSPPSbits_t U5CTSPPSbits __at(0x27B);
// bitfield macros
#define _U5CTSPPS_PIN_POSN                                  0x0
#define _U5CTSPPS_PIN_POSITION                              0x0
#define _U5CTSPPS_PIN_SIZE                                  0x3
#define _U5CTSPPS_PIN_LENGTH                                0x3
#define _U5CTSPPS_PIN_MASK                                  0x7
#define _U5CTSPPS_PORT_POSN                                 0x3
#define _U5CTSPPS_PORT_POSITION                             0x3
#define _U5CTSPPS_PORT_SIZE                                 0x3
#define _U5CTSPPS_PORT_LENGTH                               0x3
#define _U5CTSPPS_PORT_MASK                                 0x38
#define _U5CTSPPS_U5CTSPPS_POSN                             0x0
#define _U5CTSPPS_U5CTSPPS_POSITION                         0x0
#define _U5CTSPPS_U5CTSPPS_SIZE                             0x6
#define _U5CTSPPS_U5CTSPPS_LENGTH                           0x6
#define _U5CTSPPS_U5CTSPPS_MASK                             0x3F
#define _U5CTSPPS_U5CTSPPS0_POSN                            0x0
#define _U5CTSPPS_U5CTSPPS0_POSITION                        0x0
#define _U5CTSPPS_U5CTSPPS0_SIZE                            0x1
#define _U5CTSPPS_U5CTSPPS0_LENGTH                          0x1
#define _U5CTSPPS_U5CTSPPS0_MASK                            0x1
#define _U5CTSPPS_U5CTSPPS1_POSN                            0x1
#define _U5CTSPPS_U5CTSPPS1_POSITION                        0x1
#define _U5CTSPPS_U5CTSPPS1_SIZE                            0x1
#define _U5CTSPPS_U5CTSPPS1_LENGTH                          0x1
#define _U5CTSPPS_U5CTSPPS1_MASK                            0x2
#define _U5CTSPPS_U5CTSPPS2_POSN                            0x2
#define _U5CTSPPS_U5CTSPPS2_POSITION                        0x2
#define _U5CTSPPS_U5CTSPPS2_SIZE                            0x1
#define _U5CTSPPS_U5CTSPPS2_LENGTH                          0x1
#define _U5CTSPPS_U5CTSPPS2_MASK                            0x4
#define _U5CTSPPS_U5CTSPPS3_POSN                            0x3
#define _U5CTSPPS_U5CTSPPS3_POSITION                        0x3
#define _U5CTSPPS_U5CTSPPS3_SIZE                            0x1
#define _U5CTSPPS_U5CTSPPS3_LENGTH                          0x1
#define _U5CTSPPS_U5CTSPPS3_MASK                            0x8
#define _U5CTSPPS_U5CTSPPS4_POSN                            0x4
#define _U5CTSPPS_U5CTSPPS4_POSITION                        0x4
#define _U5CTSPPS_U5CTSPPS4_SIZE                            0x1
#define _U5CTSPPS_U5CTSPPS4_LENGTH                          0x1
#define _U5CTSPPS_U5CTSPPS4_MASK                            0x10
#define _U5CTSPPS_U5CTSPPS5_POSN                            0x5
#define _U5CTSPPS_U5CTSPPS5_POSITION                        0x5
#define _U5CTSPPS_U5CTSPPS5_SIZE                            0x1
#define _U5CTSPPS_U5CTSPPS5_LENGTH                          0x1
#define _U5CTSPPS_U5CTSPPS5_MASK                            0x20

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x286);
#ifndef _LIB_BUILD
asm("RC4I2C equ 0286h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned _PU0                    :1;  // Note: Changed by MikroE
        unsigned _PU1                    :1;  // Note: Changed by MikroE
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x286);
// bitfield macros
#define _RC4I2C_TH_POSN                                     0x0
#define _RC4I2C_TH_POSITION                                 0x0
#define _RC4I2C_TH_SIZE                                     0x2
#define _RC4I2C_TH_LENGTH                                   0x2
#define _RC4I2C_TH_MASK                                     0x3
#define _RC4I2C_PU_POSN                                     0x4
#define _RC4I2C_PU_POSITION                                 0x4
#define _RC4I2C_PU_SIZE                                     0x2
#define _RC4I2C_PU_LENGTH                                   0x2
#define _RC4I2C_PU_MASK                                     0x30
#define _RC4I2C_SLEW_POSN                                   0x6
#define _RC4I2C_SLEW_POSITION                               0x6
#define _RC4I2C_SLEW_SIZE                                   0x2
#define _RC4I2C_SLEW_LENGTH                                 0x2
#define _RC4I2C_SLEW_MASK                                   0xC0
#define _RC4I2C_TH0_POSN                                    0x0
#define _RC4I2C_TH0_POSITION                                0x0
#define _RC4I2C_TH0_SIZE                                    0x1
#define _RC4I2C_TH0_LENGTH                                  0x1
#define _RC4I2C_TH0_MASK                                    0x1
#define _RC4I2C_TH1_POSN                                    0x1
#define _RC4I2C_TH1_POSITION                                0x1
#define _RC4I2C_TH1_SIZE                                    0x1
#define _RC4I2C_TH1_LENGTH                                  0x1
#define _RC4I2C_TH1_MASK                                    0x2
#define _RC4I2C_PU0_POSN                                    0x4
#define _RC4I2C_PU0_POSITION                                0x4
#define _RC4I2C_PU0_SIZE                                    0x1
#define _RC4I2C_PU0_LENGTH                                  0x1
#define _RC4I2C_PU0_MASK                                    0x10
#define _RC4I2C_PU1_POSN                                    0x5
#define _RC4I2C_PU1_POSITION                                0x5
#define _RC4I2C_PU1_SIZE                                    0x1
#define _RC4I2C_PU1_LENGTH                                  0x1
#define _RC4I2C_PU1_MASK                                    0x20
#define _RC4I2C_SLEW0_POSN                                  0x6
#define _RC4I2C_SLEW0_POSITION                              0x6
#define _RC4I2C_SLEW0_SIZE                                  0x1
#define _RC4I2C_SLEW0_LENGTH                                0x1
#define _RC4I2C_SLEW0_MASK                                  0x40
#define _RC4I2C_SLEW1_POSN                                  0x7
#define _RC4I2C_SLEW1_POSITION                              0x7
#define _RC4I2C_SLEW1_SIZE                                  0x1
#define _RC4I2C_SLEW1_LENGTH                                0x1
#define _RC4I2C_SLEW1_MASK                                  0x80
#define _RC4I2C_I2CTH_POSN                                  0x0
#define _RC4I2C_I2CTH_POSITION                              0x0
#define _RC4I2C_I2CTH_SIZE                                  0x2
#define _RC4I2C_I2CTH_LENGTH                                0x2
#define _RC4I2C_I2CTH_MASK                                  0x3
#define _RC4I2C_I2CPU_POSN                                  0x4
#define _RC4I2C_I2CPU_POSITION                              0x4
#define _RC4I2C_I2CPU_SIZE                                  0x2
#define _RC4I2C_I2CPU_LENGTH                                0x2
#define _RC4I2C_I2CPU_MASK                                  0x30
#define _RC4I2C_I2CSLEW_POSN                                0x6
#define _RC4I2C_I2CSLEW_POSITION                            0x6
#define _RC4I2C_I2CSLEW_SIZE                                0x2
#define _RC4I2C_I2CSLEW_LENGTH                              0x2
#define _RC4I2C_I2CSLEW_MASK                                0xC0
#define _RC4I2C_I2CTH0_POSN                                 0x0
#define _RC4I2C_I2CTH0_POSITION                             0x0
#define _RC4I2C_I2CTH0_SIZE                                 0x1
#define _RC4I2C_I2CTH0_LENGTH                               0x1
#define _RC4I2C_I2CTH0_MASK                                 0x1
#define _RC4I2C_I2CTH1_POSN                                 0x1
#define _RC4I2C_I2CTH1_POSITION                             0x1
#define _RC4I2C_I2CTH1_SIZE                                 0x1
#define _RC4I2C_I2CTH1_LENGTH                               0x1
#define _RC4I2C_I2CTH1_MASK                                 0x2
#define _RC4I2C_I2CPU0_POSN                                 0x4
#define _RC4I2C_I2CPU0_POSITION                             0x4
#define _RC4I2C_I2CPU0_SIZE                                 0x1
#define _RC4I2C_I2CPU0_LENGTH                               0x1
#define _RC4I2C_I2CPU0_MASK                                 0x10
#define _RC4I2C_I2CPU1_POSN                                 0x5
#define _RC4I2C_I2CPU1_POSITION                             0x5
#define _RC4I2C_I2CPU1_SIZE                                 0x1
#define _RC4I2C_I2CPU1_LENGTH                               0x1
#define _RC4I2C_I2CPU1_MASK                                 0x20
#define _RC4I2C_I2CSLEW0_POSN                               0x6
#define _RC4I2C_I2CSLEW0_POSITION                           0x6
#define _RC4I2C_I2CSLEW0_SIZE                               0x1
#define _RC4I2C_I2CSLEW0_LENGTH                             0x1
#define _RC4I2C_I2CSLEW0_MASK                               0x40
#define _RC4I2C_I2CSLEW1_POSN                               0x7
#define _RC4I2C_I2CSLEW1_POSITION                           0x7
#define _RC4I2C_I2CSLEW1_SIZE                               0x1
#define _RC4I2C_I2CSLEW1_LENGTH                             0x1
#define _RC4I2C_I2CSLEW1_MASK                               0x80

// Register: RC3I2C
#define RC3I2C RC3I2C
extern volatile unsigned char           RC3I2C              __at(0x287);
#ifndef _LIB_BUILD
asm("RC3I2C equ 0287h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned _PU0                    :1;  // Note: Changed by MikroE
        unsigned _PU1                    :1;  // Note: Changed by MikroE
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC3I2Cbits_t;
extern volatile RC3I2Cbits_t RC3I2Cbits __at(0x287);
// bitfield macros
#define _RC3I2C_TH_POSN                                     0x0
#define _RC3I2C_TH_POSITION                                 0x0
#define _RC3I2C_TH_SIZE                                     0x2
#define _RC3I2C_TH_LENGTH                                   0x2
#define _RC3I2C_TH_MASK                                     0x3
#define _RC3I2C_PU_POSN                                     0x4
#define _RC3I2C_PU_POSITION                                 0x4
#define _RC3I2C_PU_SIZE                                     0x2
#define _RC3I2C_PU_LENGTH                                   0x2
#define _RC3I2C_PU_MASK                                     0x30
#define _RC3I2C_SLEW_POSN                                   0x6
#define _RC3I2C_SLEW_POSITION                               0x6
#define _RC3I2C_SLEW_SIZE                                   0x2
#define _RC3I2C_SLEW_LENGTH                                 0x2
#define _RC3I2C_SLEW_MASK                                   0xC0
#define _RC3I2C_TH0_POSN                                    0x0
#define _RC3I2C_TH0_POSITION                                0x0
#define _RC3I2C_TH0_SIZE                                    0x1
#define _RC3I2C_TH0_LENGTH                                  0x1
#define _RC3I2C_TH0_MASK                                    0x1
#define _RC3I2C_TH1_POSN                                    0x1
#define _RC3I2C_TH1_POSITION                                0x1
#define _RC3I2C_TH1_SIZE                                    0x1
#define _RC3I2C_TH1_LENGTH                                  0x1
#define _RC3I2C_TH1_MASK                                    0x2
#define _RC3I2C_PU0_POSN                                    0x4
#define _RC3I2C_PU0_POSITION                                0x4
#define _RC3I2C_PU0_SIZE                                    0x1
#define _RC3I2C_PU0_LENGTH                                  0x1
#define _RC3I2C_PU0_MASK                                    0x10
#define _RC3I2C_PU1_POSN                                    0x5
#define _RC3I2C_PU1_POSITION                                0x5
#define _RC3I2C_PU1_SIZE                                    0x1
#define _RC3I2C_PU1_LENGTH                                  0x1
#define _RC3I2C_PU1_MASK                                    0x20
#define _RC3I2C_SLEW0_POSN                                  0x6
#define _RC3I2C_SLEW0_POSITION                              0x6
#define _RC3I2C_SLEW0_SIZE                                  0x1
#define _RC3I2C_SLEW0_LENGTH                                0x1
#define _RC3I2C_SLEW0_MASK                                  0x40
#define _RC3I2C_SLEW1_POSN                                  0x7
#define _RC3I2C_SLEW1_POSITION                              0x7
#define _RC3I2C_SLEW1_SIZE                                  0x1
#define _RC3I2C_SLEW1_LENGTH                                0x1
#define _RC3I2C_SLEW1_MASK                                  0x80
#define _RC3I2C_I2CTH_POSN                                  0x0
#define _RC3I2C_I2CTH_POSITION                              0x0
#define _RC3I2C_I2CTH_SIZE                                  0x2
#define _RC3I2C_I2CTH_LENGTH                                0x2
#define _RC3I2C_I2CTH_MASK                                  0x3
#define _RC3I2C_I2CPU_POSN                                  0x4
#define _RC3I2C_I2CPU_POSITION                              0x4
#define _RC3I2C_I2CPU_SIZE                                  0x2
#define _RC3I2C_I2CPU_LENGTH                                0x2
#define _RC3I2C_I2CPU_MASK                                  0x30
#define _RC3I2C_I2CSLEW_POSN                                0x6
#define _RC3I2C_I2CSLEW_POSITION                            0x6
#define _RC3I2C_I2CSLEW_SIZE                                0x2
#define _RC3I2C_I2CSLEW_LENGTH                              0x2
#define _RC3I2C_I2CSLEW_MASK                                0xC0
#define _RC3I2C_I2CTH0_POSN                                 0x0
#define _RC3I2C_I2CTH0_POSITION                             0x0
#define _RC3I2C_I2CTH0_SIZE                                 0x1
#define _RC3I2C_I2CTH0_LENGTH                               0x1
#define _RC3I2C_I2CTH0_MASK                                 0x1
#define _RC3I2C_I2CTH1_POSN                                 0x1
#define _RC3I2C_I2CTH1_POSITION                             0x1
#define _RC3I2C_I2CTH1_SIZE                                 0x1
#define _RC3I2C_I2CTH1_LENGTH                               0x1
#define _RC3I2C_I2CTH1_MASK                                 0x2
#define _RC3I2C_I2CPU0_POSN                                 0x4
#define _RC3I2C_I2CPU0_POSITION                             0x4
#define _RC3I2C_I2CPU0_SIZE                                 0x1
#define _RC3I2C_I2CPU0_LENGTH                               0x1
#define _RC3I2C_I2CPU0_MASK                                 0x10
#define _RC3I2C_I2CPU1_POSN                                 0x5
#define _RC3I2C_I2CPU1_POSITION                             0x5
#define _RC3I2C_I2CPU1_SIZE                                 0x1
#define _RC3I2C_I2CPU1_LENGTH                               0x1
#define _RC3I2C_I2CPU1_MASK                                 0x20
#define _RC3I2C_I2CSLEW0_POSN                               0x6
#define _RC3I2C_I2CSLEW0_POSITION                           0x6
#define _RC3I2C_I2CSLEW0_SIZE                               0x1
#define _RC3I2C_I2CSLEW0_LENGTH                             0x1
#define _RC3I2C_I2CSLEW0_MASK                               0x40
#define _RC3I2C_I2CSLEW1_POSN                               0x7
#define _RC3I2C_I2CSLEW1_POSITION                           0x7
#define _RC3I2C_I2CSLEW1_SIZE                               0x1
#define _RC3I2C_I2CSLEW1_LENGTH                             0x1
#define _RC3I2C_I2CSLEW1_MASK                               0x80

// Register: RB2I2C
#define RB2I2C RB2I2C
extern volatile unsigned char           RB2I2C              __at(0x288);
#ifndef _LIB_BUILD
asm("RB2I2C equ 0288h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned _PU0                    :1;  // Note: Changed by MikroE
        unsigned _PU1                    :1;  // Note: Changed by MikroE
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RB2I2Cbits_t;
