MikroElektronika/core_packages/PIC/XC8/def/PIC18F46Q43/mcu.h
extern volatile __bit                   DATA10              __at(0x1A82);	// @ (0x350 * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATH,2)
// CRCDATH<DATA11>
extern volatile __bit                   DATA11              __at(0x1A83);	// @ (0x350 * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATH,3)
// CRCDATH<DATA12>
extern volatile __bit                   DATA12              __at(0x1A84);	// @ (0x350 * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATH,4)
// CRCDATH<DATA13>
extern volatile __bit                   DATA13              __at(0x1A85);	// @ (0x350 * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATH,5)
// CRCDATH<DATA14>
extern volatile __bit                   DATA14              __at(0x1A86);	// @ (0x350 * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATH,6)
// CRCDATH<DATA15>
extern volatile __bit                   DATA15              __at(0x1A87);	// @ (0x350 * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATH,7)
// CRCDATL<DATA2>
extern volatile __bit                   DATA2               __at(0x1A7A);	// @ (0x34F * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATL,2)
// CRCDATL<DATA3>
extern volatile __bit                   DATA3               __at(0x1A7B);	// @ (0x34F * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATL,3)
// CRCDATL<DATA4>
extern volatile __bit                   DATA4               __at(0x1A7C);	// @ (0x34F * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATL,4)
// CRCDATL<DATA5>
extern volatile __bit                   DATA5               __at(0x1A7D);	// @ (0x34F * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATL,5)
// CRCDATL<DATA6>
extern volatile __bit                   DATA6               __at(0x1A7E);	// @ (0x34F * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATL,6)
// CRCDATL<DATA7>
extern volatile __bit                   DATA7               __at(0x1A7F);	// @ (0x34F * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATL,7)
// CRCDATH<DATA8>
extern volatile __bit                   DATA8               __at(0x1A80);	// @ (0x350 * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATH,0)
// CRCDATH<DATA9>
extern volatile __bit                   DATA9               __at(0x1A81);	// @ (0x350 * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATH,1)
// CLKRCON<DC0>
extern volatile __bit                   DC0                 __at(0x1CB);	// @ (0x39 * 8 + 3)
#define                                 DC0_bit             _BIT_ACCESS(CLKRCON,3)
// CLKRCON<DC1>
extern volatile __bit                   DC1                 __at(0x1CC);	// @ (0x39 * 8 + 4)
#define                                 DC1_bit             _BIT_ACCESS(CLKRCON,4)
// DMAnDCNTL<DCNT0>
extern volatile __bit                   DCNT0               __at(0x750);	// @ (0xEA * 8 + 0)
#define                                 DCNT0_bit           _BIT_ACCESS(DMAnDCNTL,0)
// DMAnDCNTL<DCNT1>
extern volatile __bit                   DCNT1               __at(0x751);	// @ (0xEA * 8 + 1)
#define                                 DCNT1_bit           _BIT_ACCESS(DMAnDCNTL,1)
// DMAnDCNTH<DCNT10>
extern volatile __bit                   DCNT10              __at(0x75A);	// @ (0xEB * 8 + 2)
#define                                 DCNT10_bit          _BIT_ACCESS(DMAnDCNTH,2)
// DMAnDCNTH<DCNT11>
extern volatile __bit                   DCNT11              __at(0x75B);	// @ (0xEB * 8 + 3)
#define                                 DCNT11_bit          _BIT_ACCESS(DMAnDCNTH,3)
// DMAnDCNTL<DCNT2>
extern volatile __bit                   DCNT2               __at(0x752);	// @ (0xEA * 8 + 2)
#define                                 DCNT2_bit           _BIT_ACCESS(DMAnDCNTL,2)
// DMAnDCNTL<DCNT3>
extern volatile __bit                   DCNT3               __at(0x753);	// @ (0xEA * 8 + 3)
#define                                 DCNT3_bit           _BIT_ACCESS(DMAnDCNTL,3)
// DMAnDCNTL<DCNT4>
extern volatile __bit                   DCNT4               __at(0x754);	// @ (0xEA * 8 + 4)
#define                                 DCNT4_bit           _BIT_ACCESS(DMAnDCNTL,4)
// DMAnDCNTL<DCNT5>
extern volatile __bit                   DCNT5               __at(0x755);	// @ (0xEA * 8 + 5)
#define                                 DCNT5_bit           _BIT_ACCESS(DMAnDCNTL,5)
// DMAnDCNTL<DCNT6>
extern volatile __bit                   DCNT6               __at(0x756);	// @ (0xEA * 8 + 6)
#define                                 DCNT6_bit           _BIT_ACCESS(DMAnDCNTL,6)
// DMAnDCNTL<DCNT7>
extern volatile __bit                   DCNT7               __at(0x757);	// @ (0xEA * 8 + 7)
#define                                 DCNT7_bit           _BIT_ACCESS(DMAnDCNTL,7)
// DMAnDCNTH<DCNT8>
extern volatile __bit                   DCNT8               __at(0x758);	// @ (0xEB * 8 + 0)
#define                                 DCNT8_bit           _BIT_ACCESS(DMAnDCNTH,0)
// DMAnDCNTH<DCNT9>
extern volatile __bit                   DCNT9               __at(0x759);	// @ (0xEB * 8 + 1)
#define                                 DCNT9_bit           _BIT_ACCESS(DMAnDCNTH,1)
// DMAnCON0<DGO>
extern volatile __bit                   DGO                 __at(0x7E5);	// @ (0xFC * 8 + 5)
#define                                 DGO_bit             _BIT_ACCESS(DMAnCON0,5)
// CLKRCON<DIV0>
extern volatile __bit                   DIV0                __at(0x1C8);	// @ (0x39 * 8 + 0)
#define                                 DIV0_bit            _BIT_ACCESS(CLKRCON,0)
// CLKRCON<DIV1>
extern volatile __bit                   DIV1                __at(0x1C9);	// @ (0x39 * 8 + 1)
#define                                 DIV1_bit            _BIT_ACCESS(CLKRCON,1)
// CLKRCON<DIV2>
extern volatile __bit                   DIV2                __at(0x1CA);	// @ (0x39 * 8 + 2)
#define                                 DIV2_bit            _BIT_ACCESS(CLKRCON,2)
// CRCCON1<DLEN0>
extern volatile __bit                   DLEN0               __at(0x1AC4);	// @ (0x358 * 8 + 4)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON1,4)
// CRCCON1<DLEN1>
extern volatile __bit                   DLEN1               __at(0x1AC5);	// @ (0x358 * 8 + 5)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON1,5)
// CRCCON1<DLEN2>
extern volatile __bit                   DLEN2               __at(0x1AC6);	// @ (0x358 * 8 + 6)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON1,6)
// CRCCON1<DLEN3>
extern volatile __bit                   DLEN3               __at(0x1AC7);	// @ (0x358 * 8 + 7)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON1,7)
// PIE2<DMA1AIE>
extern volatile __bit                   DMA1AIE             __at(0x2507);	// @ (0x4A0 * 8 + 7)
#define                                 DMA1AIE_bit         _BIT_ACCESS(PIE2,7)
// PIR2<DMA1AIF>
extern volatile __bit                   DMA1AIF             __at(0x2587);	// @ (0x4B0 * 8 + 7)
#define                                 DMA1AIF_bit         _BIT_ACCESS(PIR2,7)
// IPR2<DMA1AIP>
extern volatile __bit                   DMA1AIP             __at(0x1B27);	// @ (0x364 * 8 + 7)
#define                                 DMA1AIP_bit         _BIT_ACCESS(IPR2,7)
// PIE2<DMA1DCNTIE>
extern volatile __bit                   DMA1DCNTIE          __at(0x2505);	// @ (0x4A0 * 8 + 5)
#define                                 DMA1DCNTIE_bit      _BIT_ACCESS(PIE2,5)
// PIR2<DMA1DCNTIF>
extern volatile __bit                   DMA1DCNTIF          __at(0x2585);	// @ (0x4B0 * 8 + 5)
#define                                 DMA1DCNTIF_bit      _BIT_ACCESS(PIR2,5)
// IPR2<DMA1DCNTIP>
extern volatile __bit                   DMA1DCNTIP          __at(0x1B25);	// @ (0x364 * 8 + 5)
#define                                 DMA1DCNTIP_bit      _BIT_ACCESS(IPR2,5)
// PMD8<DMA1MD>
extern volatile __bit                   DMA1MD              __at(0x340);	// @ (0x68 * 8 + 0)
#define                                 DMA1MD_bit          _BIT_ACCESS(PMD8,0)
// PIE2<DMA1ORIE>
extern volatile __bit                   DMA1ORIE            __at(0x2506);	// @ (0x4A0 * 8 + 6)
#define                                 DMA1ORIE_bit        _BIT_ACCESS(PIE2,6)
// PIR2<DMA1ORIF>
extern volatile __bit                   DMA1ORIF            __at(0x2586);	// @ (0x4B0 * 8 + 6)
#define                                 DMA1ORIF_bit        _BIT_ACCESS(PIR2,6)
// IPR2<DMA1ORIP>
extern volatile __bit                   DMA1ORIP            __at(0x1B26);	// @ (0x364 * 8 + 6)
#define                                 DMA1ORIP_bit        _BIT_ACCESS(IPR2,6)
// DMA1PR<DMA1PR0>
extern volatile __bit                   DMA1PR0             __at(0x5B0);	// @ (0xB6 * 8 + 0)
#define                                 DMA1PR0_bit         _BIT_ACCESS(DMA1PR,0)
// DMA1PR<DMA1PR1>
extern volatile __bit                   DMA1PR1             __at(0x5B1);	// @ (0xB6 * 8 + 1)
#define                                 DMA1PR1_bit         _BIT_ACCESS(DMA1PR,1)
// DMA1PR<DMA1PR2>
extern volatile __bit                   DMA1PR2             __at(0x5B2);	// @ (0xB6 * 8 + 2)
#define                                 DMA1PR2_bit         _BIT_ACCESS(DMA1PR,2)
// PIE2<DMA1SCNTIE>
extern volatile __bit                   DMA1SCNTIE          __at(0x2504);	// @ (0x4A0 * 8 + 4)
#define                                 DMA1SCNTIE_bit      _BIT_ACCESS(PIE2,4)
// PIR2<DMA1SCNTIF>
extern volatile __bit                   DMA1SCNTIF          __at(0x2584);	// @ (0x4B0 * 8 + 4)
#define                                 DMA1SCNTIF_bit      _BIT_ACCESS(PIR2,4)
// IPR2<DMA1SCNTIP>
extern volatile __bit                   DMA1SCNTIP          __at(0x1B24);	// @ (0x364 * 8 + 4)
#define                                 DMA1SCNTIP_bit      _BIT_ACCESS(IPR2,4)
// PIE6<DMA2AIE>
extern volatile __bit                   DMA2AIE             __at(0x2527);	// @ (0x4A4 * 8 + 7)
#define                                 DMA2AIE_bit         _BIT_ACCESS(PIE6,7)
// PIR6<DMA2AIF>
extern volatile __bit                   DMA2AIF             __at(0x25A7);	// @ (0x4B4 * 8 + 7)
#define                                 DMA2AIF_bit         _BIT_ACCESS(PIR6,7)
// IPR6<DMA2AIP>
extern volatile __bit                   DMA2AIP             __at(0x1B47);	// @ (0x368 * 8 + 7)
#define                                 DMA2AIP_bit         _BIT_ACCESS(IPR6,7)
// PIE6<DMA2DCNTIE>
extern volatile __bit                   DMA2DCNTIE          __at(0x2525);	// @ (0x4A4 * 8 + 5)
#define                                 DMA2DCNTIE_bit      _BIT_ACCESS(PIE6,5)
// PIR6<DMA2DCNTIF>
extern volatile __bit                   DMA2DCNTIF          __at(0x25A5);	// @ (0x4B4 * 8 + 5)
#define                                 DMA2DCNTIF_bit      _BIT_ACCESS(PIR6,5)
// IPR6<DMA2DCNTIP>
extern volatile __bit                   DMA2DCNTIP          __at(0x1B45);	// @ (0x368 * 8 + 5)
#define                                 DMA2DCNTIP_bit      _BIT_ACCESS(IPR6,5)
// PMD8<DMA2MD>
extern volatile __bit                   DMA2MD              __at(0x341);	// @ (0x68 * 8 + 1)
#define                                 DMA2MD_bit          _BIT_ACCESS(PMD8,1)
// PIE6<DMA2ORIE>
extern volatile __bit                   DMA2ORIE            __at(0x2526);	// @ (0x4A4 * 8 + 6)
#define                                 DMA2ORIE_bit        _BIT_ACCESS(PIE6,6)
// PIR6<DMA2ORIF>
extern volatile __bit                   DMA2ORIF            __at(0x25A6);	// @ (0x4B4 * 8 + 6)
#define                                 DMA2ORIF_bit        _BIT_ACCESS(PIR6,6)
// IPR6<DMA2ORIP>
extern volatile __bit                   DMA2ORIP            __at(0x1B46);	// @ (0x368 * 8 + 6)
#define                                 DMA2ORIP_bit        _BIT_ACCESS(IPR6,6)
// DMA2PR<DMA2PR0>
extern volatile __bit                   DMA2PR0             __at(0x5B8);	// @ (0xB7 * 8 + 0)
#define                                 DMA2PR0_bit         _BIT_ACCESS(DMA2PR,0)
// DMA2PR<DMA2PR1>
extern volatile __bit                   DMA2PR1             __at(0x5B9);	// @ (0xB7 * 8 + 1)
#define                                 DMA2PR1_bit         _BIT_ACCESS(DMA2PR,1)
// DMA2PR<DMA2PR2>
extern volatile __bit                   DMA2PR2             __at(0x5BA);	// @ (0xB7 * 8 + 2)
#define                                 DMA2PR2_bit         _BIT_ACCESS(DMA2PR,2)
// PIE6<DMA2SCNTIE>
extern volatile __bit                   DMA2SCNTIE          __at(0x2524);	// @ (0x4A4 * 8 + 4)
#define                                 DMA2SCNTIE_bit      _BIT_ACCESS(PIE6,4)
// PIR6<DMA2SCNTIF>
extern volatile __bit                   DMA2SCNTIF          __at(0x25A4);	// @ (0x4B4 * 8 + 4)
#define                                 DMA2SCNTIF_bit      _BIT_ACCESS(PIR6,4)
// IPR6<DMA2SCNTIP>
extern volatile __bit                   DMA2SCNTIP          __at(0x1B44);	// @ (0x368 * 8 + 4)
#define                                 DMA2SCNTIP_bit      _BIT_ACCESS(IPR6,4)
// PIE10<DMA3AIE>
extern volatile __bit                   DMA3AIE             __at(0x2547);	// @ (0x4A8 * 8 + 7)
#define                                 DMA3AIE_bit         _BIT_ACCESS(PIE10,7)
// PIR10<DMA3AIF>
extern volatile __bit                   DMA3AIF             __at(0x25C7);	// @ (0x4B8 * 8 + 7)
#define                                 DMA3AIF_bit         _BIT_ACCESS(PIR10,7)
// IPR10<DMA3AIP>
extern volatile __bit                   DMA3AIP             __at(0x1B67);	// @ (0x36C * 8 + 7)
#define                                 DMA3AIP_bit         _BIT_ACCESS(IPR10,7)
// PIE10<DMA3DCNTIE>
extern volatile __bit                   DMA3DCNTIE          __at(0x2545);	// @ (0x4A8 * 8 + 5)
#define                                 DMA3DCNTIE_bit      _BIT_ACCESS(PIE10,5)
// PIR10<DMA3DCNTIF>
extern volatile __bit                   DMA3DCNTIF          __at(0x25C5);	// @ (0x4B8 * 8 + 5)
#define                                 DMA3DCNTIF_bit      _BIT_ACCESS(PIR10,5)
// IPR10<DMA3DCNTIP>
extern volatile __bit                   DMA3DCNTIP          __at(0x1B65);	// @ (0x36C * 8 + 5)
#define                                 DMA3DCNTIP_bit      _BIT_ACCESS(IPR10,5)
// PMD8<DMA3MD>
extern volatile __bit                   DMA3MD              __at(0x342);	// @ (0x68 * 8 + 2)
#define                                 DMA3MD_bit          _BIT_ACCESS(PMD8,2)
// PIE10<DMA3ORIE>
extern volatile __bit                   DMA3ORIE            __at(0x2546);	// @ (0x4A8 * 8 + 6)
#define                                 DMA3ORIE_bit        _BIT_ACCESS(PIE10,6)
// PIR10<DMA3ORIF>
extern volatile __bit                   DMA3ORIF            __at(0x25C6);	// @ (0x4B8 * 8 + 6)
#define                                 DMA3ORIF_bit        _BIT_ACCESS(PIR10,6)
// IPR10<DMA3ORIP>
extern volatile __bit                   DMA3ORIP            __at(0x1B66);	// @ (0x36C * 8 + 6)
#define                                 DMA3ORIP_bit        _BIT_ACCESS(IPR10,6)
// DMA3PR<DMA3PR0>
extern volatile __bit                   DMA3PR0             __at(0x5C0);	// @ (0xB8 * 8 + 0)
#define                                 DMA3PR0_bit         _BIT_ACCESS(DMA3PR,0)
// DMA3PR<DMA3PR1>
extern volatile __bit                   DMA3PR1             __at(0x5C1);	// @ (0xB8 * 8 + 1)
#define                                 DMA3PR1_bit         _BIT_ACCESS(DMA3PR,1)
// DMA3PR<DMA3PR2>
extern volatile __bit                   DMA3PR2             __at(0x5C2);	// @ (0xB8 * 8 + 2)
#define                                 DMA3PR2_bit         _BIT_ACCESS(DMA3PR,2)
// PIE10<DMA3SCNTIE>
extern volatile __bit                   DMA3SCNTIE          __at(0x2544);	// @ (0x4A8 * 8 + 4)
#define                                 DMA3SCNTIE_bit      _BIT_ACCESS(PIE10,4)
// PIR10<DMA3SCNTIF>
extern volatile __bit                   DMA3SCNTIF          __at(0x25C4);	// @ (0x4B8 * 8 + 4)
#define                                 DMA3SCNTIF_bit      _BIT_ACCESS(PIR10,4)
// IPR10<DMA3SCNTIP>
extern volatile __bit                   DMA3SCNTIP          __at(0x1B64);	// @ (0x36C * 8 + 4)
#define                                 DMA3SCNTIP_bit      _BIT_ACCESS(IPR10,4)
// PIE11<DMA4AIE>
extern volatile __bit                   DMA4AIE             __at(0x254F);	// @ (0x4A9 * 8 + 7)
#define                                 DMA4AIE_bit         _BIT_ACCESS(PIE11,7)
// PIR11<DMA4AIF>
extern volatile __bit                   DMA4AIF             __at(0x25CF);	// @ (0x4B9 * 8 + 7)
#define                                 DMA4AIF_bit         _BIT_ACCESS(PIR11,7)
// IPR11<DMA4AIP>
extern volatile __bit                   DMA4AIP             __at(0x1B6F);	// @ (0x36D * 8 + 7)
#define                                 DMA4AIP_bit         _BIT_ACCESS(IPR11,7)
// PIE11<DMA4DCNTIE>
extern volatile __bit                   DMA4DCNTIE          __at(0x254D);	// @ (0x4A9 * 8 + 5)
#define                                 DMA4DCNTIE_bit      _BIT_ACCESS(PIE11,5)
// PIR11<DMA4DCNTIF>
extern volatile __bit                   DMA4DCNTIF          __at(0x25CD);	// @ (0x4B9 * 8 + 5)
#define                                 DMA4DCNTIF_bit      _BIT_ACCESS(PIR11,5)
// IPR11<DMA4DCNTIP>
extern volatile __bit                   DMA4DCNTIP          __at(0x1B6D);	// @ (0x36D * 8 + 5)
#define                                 DMA4DCNTIP_bit      _BIT_ACCESS(IPR11,5)
// PMD8<DMA4MD>
extern volatile __bit                   DMA4MD              __at(0x343);	// @ (0x68 * 8 + 3)
#define                                 DMA4MD_bit          _BIT_ACCESS(PMD8,3)
// PIE11<DMA4ORIE>
extern volatile __bit                   DMA4ORIE            __at(0x254E);	// @ (0x4A9 * 8 + 6)
#define                                 DMA4ORIE_bit        _BIT_ACCESS(PIE11,6)
// PIR11<DMA4ORIF>
extern volatile __bit                   DMA4ORIF            __at(0x25CE);	// @ (0x4B9 * 8 + 6)
#define                                 DMA4ORIF_bit        _BIT_ACCESS(PIR11,6)
// IPR11<DMA4ORIP>
extern volatile __bit                   DMA4ORIP            __at(0x1B6E);	// @ (0x36D * 8 + 6)
#define                                 DMA4ORIP_bit        _BIT_ACCESS(IPR11,6)
// DMA4PR<DMA4PR0>
extern volatile __bit                   DMA4PR0             __at(0x5C8);	// @ (0xB9 * 8 + 0)
#define                                 DMA4PR0_bit         _BIT_ACCESS(DMA4PR,0)
// DMA4PR<DMA4PR1>
extern volatile __bit                   DMA4PR1             __at(0x5C9);	// @ (0xB9 * 8 + 1)
#define                                 DMA4PR1_bit         _BIT_ACCESS(DMA4PR,1)
// DMA4PR<DMA4PR2>
extern volatile __bit                   DMA4PR2             __at(0x5CA);	// @ (0xB9 * 8 + 2)
#define                                 DMA4PR2_bit         _BIT_ACCESS(DMA4PR,2)
// PIE11<DMA4SCNTIE>
extern volatile __bit                   DMA4SCNTIE          __at(0x254C);	// @ (0x4A9 * 8 + 4)
#define                                 DMA4SCNTIE_bit      _BIT_ACCESS(PIE11,4)
// PIR11<DMA4SCNTIF>
extern volatile __bit                   DMA4SCNTIF          __at(0x25CC);	// @ (0x4B9 * 8 + 4)
#define                                 DMA4SCNTIF_bit      _BIT_ACCESS(PIR11,4)
// IPR11<DMA4SCNTIP>
extern volatile __bit                   DMA4SCNTIP          __at(0x1B6C);	// @ (0x36D * 8 + 4)
#define                                 DMA4SCNTIP_bit      _BIT_ACCESS(IPR11,4)
// PIE12<DMA5AIE>
extern volatile __bit                   DMA5AIE             __at(0x2557);	// @ (0x4AA * 8 + 7)
#define                                 DMA5AIE_bit         _BIT_ACCESS(PIE12,7)
// PIR12<DMA5AIF>
extern volatile __bit                   DMA5AIF             __at(0x25D7);	// @ (0x4BA * 8 + 7)
#define                                 DMA5AIF_bit         _BIT_ACCESS(PIR12,7)
// IPR12<DMA5AIP>
extern volatile __bit                   DMA5AIP             __at(0x1B77);	// @ (0x36E * 8 + 7)
#define                                 DMA5AIP_bit         _BIT_ACCESS(IPR12,7)
// PIE12<DMA5DCNTIE>
extern volatile __bit                   DMA5DCNTIE          __at(0x2555);	// @ (0x4AA * 8 + 5)
#define                                 DMA5DCNTIE_bit      _BIT_ACCESS(PIE12,5)
// PIR12<DMA5DCNTIF>
extern volatile __bit                   DMA5DCNTIF          __at(0x25D5);	// @ (0x4BA * 8 + 5)
#define                                 DMA5DCNTIF_bit      _BIT_ACCESS(PIR12,5)
// IPR12<DMA5DCNTIP>
extern volatile __bit                   DMA5DCNTIP          __at(0x1B75);	// @ (0x36E * 8 + 5)
#define                                 DMA5DCNTIP_bit      _BIT_ACCESS(IPR12,5)
// PMD8<DMA5MD>
extern volatile __bit                   DMA5MD              __at(0x344);	// @ (0x68 * 8 + 4)
#define                                 DMA5MD_bit          _BIT_ACCESS(PMD8,4)
// PIE12<DMA5ORIE>
extern volatile __bit                   DMA5ORIE            __at(0x2556);	// @ (0x4AA * 8 + 6)
#define                                 DMA5ORIE_bit        _BIT_ACCESS(PIE12,6)
// PIR12<DMA5ORIF>
extern volatile __bit                   DMA5ORIF            __at(0x25D6);	// @ (0x4BA * 8 + 6)
#define                                 DMA5ORIF_bit        _BIT_ACCESS(PIR12,6)
// IPR12<DMA5ORIP>
extern volatile __bit                   DMA5ORIP            __at(0x1B76);	// @ (0x36E * 8 + 6)
#define                                 DMA5ORIP_bit        _BIT_ACCESS(IPR12,6)
// DMA5PR<DMA5PR0>
extern volatile __bit                   DMA5PR0             __at(0x5D0);	// @ (0xBA * 8 + 0)
#define                                 DMA5PR0_bit         _BIT_ACCESS(DMA5PR,0)
// DMA5PR<DMA5PR1>
extern volatile __bit                   DMA5PR1             __at(0x5D1);	// @ (0xBA * 8 + 1)
#define                                 DMA5PR1_bit         _BIT_ACCESS(DMA5PR,1)
// DMA5PR<DMA5PR2>
extern volatile __bit                   DMA5PR2             __at(0x5D2);	// @ (0xBA * 8 + 2)
#define                                 DMA5PR2_bit         _BIT_ACCESS(DMA5PR,2)
// PIE12<DMA5SCNTIE>
extern volatile __bit                   DMA5SCNTIE          __at(0x2554);	// @ (0x4AA * 8 + 4)
#define                                 DMA5SCNTIE_bit      _BIT_ACCESS(PIE12,4)
// PIR12<DMA5SCNTIF>
extern volatile __bit                   DMA5SCNTIF          __at(0x25D4);	// @ (0x4BA * 8 + 4)
#define                                 DMA5SCNTIF_bit      _BIT_ACCESS(PIR12,4)
// IPR12<DMA5SCNTIP>
extern volatile __bit                   DMA5SCNTIP          __at(0x1B74);	// @ (0x36E * 8 + 4)
#define                                 DMA5SCNTIP_bit      _BIT_ACCESS(IPR12,4)
// PIE13<DMA6AIE>
extern volatile __bit                   DMA6AIE             __at(0x255F);	// @ (0x4AB * 8 + 7)
#define                                 DMA6AIE_bit         _BIT_ACCESS(PIE13,7)
// PIR13<DMA6AIF>
extern volatile __bit                   DMA6AIF             __at(0x25DF);	// @ (0x4BB * 8 + 7)
#define                                 DMA6AIF_bit         _BIT_ACCESS(PIR13,7)
// IPR13<DMA6AIP>
extern volatile __bit                   DMA6AIP             __at(0x1B7F);	// @ (0x36F * 8 + 7)
#define                                 DMA6AIP_bit         _BIT_ACCESS(IPR13,7)
// PIE13<DMA6DCNTIE>
extern volatile __bit                   DMA6DCNTIE          __at(0x255D);	// @ (0x4AB * 8 + 5)
#define                                 DMA6DCNTIE_bit      _BIT_ACCESS(PIE13,5)
// PIR13<DMA6DCNTIF>
extern volatile __bit                   DMA6DCNTIF          __at(0x25DD);	// @ (0x4BB * 8 + 5)
#define                                 DMA6DCNTIF_bit      _BIT_ACCESS(PIR13,5)
// IPR13<DMA6DCNTIP>
extern volatile __bit                   DMA6DCNTIP          __at(0x1B7D);	// @ (0x36F * 8 + 5)
#define                                 DMA6DCNTIP_bit      _BIT_ACCESS(IPR13,5)
// PMD8<DMA6MD>
extern volatile __bit                   DMA6MD              __at(0x345);	// @ (0x68 * 8 + 5)
#define                                 DMA6MD_bit          _BIT_ACCESS(PMD8,5)
// PIE13<DMA6ORIE>
