MikroElektronika/core_packages/PIC/XC8/def/PIC18F46Q43/mcu.h
#define                                 U4EIP_bit           _BIT_ACCESS(IPR12,2)
// U4ERRIE<U4FERIE>
extern volatile __bit                   U4FERIE             __at(0x1763);	// @ (0x2EC * 8 + 3)
#define                                 U4FERIE_bit         _BIT_ACCESS(U4ERRIE,3)
// U4ERRIR<U4FERIF>
extern volatile __bit                   U4FERIF             __at(0x175B);	// @ (0x2EB * 8 + 3)
#define                                 U4FERIF_bit         _BIT_ACCESS(U4ERRIR,3)
// U4CON2<U4FLO0>
extern volatile __bit                   U4FLO0              __at(0x1730);	// @ (0x2E6 * 8 + 0)
#define                                 U4FLO0_bit          _BIT_ACCESS(U4CON2,0)
// U4CON2<U4FLO1>
extern volatile __bit                   U4FLO1              __at(0x1731);	// @ (0x2E6 * 8 + 1)
#define                                 U4FLO1_bit          _BIT_ACCESS(U4CON2,1)
// PIE12<U4IE>
extern volatile __bit                   U4IE                __at(0x2553);	// @ (0x4AA * 8 + 3)
#define                                 U4IE_bit            _BIT_ACCESS(PIE12,3)
// PIR12<U4IF>
extern volatile __bit                   U4IF                __at(0x25D3);	// @ (0x4BA * 8 + 3)
#define                                 U4IF_bit            _BIT_ACCESS(PIR12,3)
// IPR12<U4IP>
extern volatile __bit                   U4IP                __at(0x1B73);	// @ (0x36E * 8 + 3)
#define                                 U4IP_bit            _BIT_ACCESS(IPR12,3)
// PMD6<U4MD>
extern volatile __bit                   U4MD                __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 U4MD_bit            _BIT_ACCESS(PMD6,6)
// U4CON0<U4MODE0>
extern volatile __bit                   U4MODE0             __at(0x1720);	// @ (0x2E4 * 8 + 0)
#define                                 U4MODE0_bit         _BIT_ACCESS(U4CON0,0)
// U4CON0<U4MODE1>
extern volatile __bit                   U4MODE1             __at(0x1721);	// @ (0x2E4 * 8 + 1)
#define                                 U4MODE1_bit         _BIT_ACCESS(U4CON0,1)
// U4CON0<U4MODE2>
extern volatile __bit                   U4MODE2             __at(0x1722);	// @ (0x2E4 * 8 + 2)
#define                                 U4MODE2_bit         _BIT_ACCESS(U4CON0,2)
// U4CON1<U4ON>
extern volatile __bit                   U4ON                __at(0x172F);	// @ (0x2E5 * 8 + 7)
#define                                 U4ON_bit            _BIT_ACCESS(U4CON1,7)
// U4ERRIE<U4PERIE>
extern volatile __bit                   U4PERIE             __at(0x1766);	// @ (0x2EC * 8 + 6)
#define                                 U4PERIE_bit         _BIT_ACCESS(U4ERRIE,6)
// U4ERRIR<U4PERIF>
extern volatile __bit                   U4PERIF             __at(0x175E);	// @ (0x2EB * 8 + 6)
#define                                 U4PERIF_bit         _BIT_ACCESS(U4ERRIR,6)
// U4FIFO<U4RCIDL>
extern volatile __bit                   U4RCIDL             __at(0x174B);	// @ (0x2E9 * 8 + 3)
#define                                 U4RCIDL_bit         _BIT_ACCESS(U4FIFO,3)
// U4CON2<U4RUNOVF>
extern volatile __bit                   U4RUNOVF            __at(0x1737);	// @ (0x2E6 * 8 + 7)
#define                                 U4RUNOVF_bit        _BIT_ACCESS(U4CON2,7)
// U4FIFO<U4RXBE>
extern volatile __bit                   U4RXBE              __at(0x1749);	// @ (0x2E9 * 8 + 1)
#define                                 U4RXBE_bit          _BIT_ACCESS(U4FIFO,1)
// U4FIFO<U4RXBF>
extern volatile __bit                   U4RXBF              __at(0x1748);	// @ (0x2E9 * 8 + 0)
#define                                 U4RXBF_bit          _BIT_ACCESS(U4FIFO,0)
// U4CON1<U4RXBIMD>
extern volatile __bit                   U4RXBIMD            __at(0x172B);	// @ (0x2E5 * 8 + 3)
#define                                 U4RXBIMD_bit        _BIT_ACCESS(U4CON1,3)
// U4ERRIE<U4RXBKIE>
extern volatile __bit                   U4RXBKIE            __at(0x1762);	// @ (0x2EC * 8 + 2)
#define                                 U4RXBKIE_bit        _BIT_ACCESS(U4ERRIE,2)
// U4ERRIR<U4RXBKIF>
extern volatile __bit                   U4RXBKIF            __at(0x175A);	// @ (0x2EB * 8 + 2)
#define                                 U4RXBKIF_bit        _BIT_ACCESS(U4ERRIR,2)
// U4CON0<U4RXEN>
extern volatile __bit                   U4RXEN              __at(0x1724);	// @ (0x2E4 * 8 + 4)
#define                                 U4RXEN_bit          _BIT_ACCESS(U4CON0,4)
// U4ERRIE<U4RXFOIE>
extern volatile __bit                   U4RXFOIE            __at(0x1761);	// @ (0x2EC * 8 + 1)
#define                                 U4RXFOIE_bit        _BIT_ACCESS(U4ERRIE,1)
// U4ERRIR<U4RXFOIF>
extern volatile __bit                   U4RXFOIF            __at(0x1759);	// @ (0x2EB * 8 + 1)
#define                                 U4RXFOIF_bit        _BIT_ACCESS(U4ERRIR,1)
// U4FIFO<U4RXIDL>
extern volatile __bit                   U4RXIDL             __at(0x174B);	// @ (0x2E9 * 8 + 3)
#define                                 U4RXIDL_bit         _BIT_ACCESS(U4FIFO,3)
// PIE12<U4RXIE>
extern volatile __bit                   U4RXIE              __at(0x2550);	// @ (0x4AA * 8 + 0)
#define                                 U4RXIE_bit          _BIT_ACCESS(PIE12,0)
// PIR12<U4RXIF>
extern volatile __bit                   U4RXIF              __at(0x25D0);	// @ (0x4BA * 8 + 0)
#define                                 U4RXIF_bit          _BIT_ACCESS(PIR12,0)
// IPR12<U4RXIP>
extern volatile __bit                   U4RXIP              __at(0x1B70);	// @ (0x36E * 8 + 0)
#define                                 U4RXIP_bit          _BIT_ACCESS(IPR12,0)
// U4CON2<U4RXPOL>
extern volatile __bit                   U4RXPOL             __at(0x1736);	// @ (0x2E6 * 8 + 6)
#define                                 U4RXPOL_bit         _BIT_ACCESS(U4CON2,6)
// U4RXPPS<U4RXPPS0>
extern volatile __bit                   U4RXPPS0            __at(0x13C0);	// @ (0x278 * 8 + 0)
#define                                 U4RXPPS0_bit        _BIT_ACCESS(U4RXPPS,0)
// U4RXPPS<U4RXPPS1>
extern volatile __bit                   U4RXPPS1            __at(0x13C1);	// @ (0x278 * 8 + 1)
#define                                 U4RXPPS1_bit        _BIT_ACCESS(U4RXPPS,1)
// U4RXPPS<U4RXPPS2>
extern volatile __bit                   U4RXPPS2            __at(0x13C2);	// @ (0x278 * 8 + 2)
#define                                 U4RXPPS2_bit        _BIT_ACCESS(U4RXPPS,2)
// U4RXPPS<U4RXPPS3>
extern volatile __bit                   U4RXPPS3            __at(0x13C3);	// @ (0x278 * 8 + 3)
#define                                 U4RXPPS3_bit        _BIT_ACCESS(U4RXPPS,3)
// U4RXPPS<U4RXPPS4>
extern volatile __bit                   U4RXPPS4            __at(0x13C4);	// @ (0x278 * 8 + 4)
#define                                 U4RXPPS4_bit        _BIT_ACCESS(U4RXPPS,4)
// U4CON1<U4SENDB>
extern volatile __bit                   U4SENDB             __at(0x1728);	// @ (0x2E5 * 8 + 0)
#define                                 U4SENDB_bit         _BIT_ACCESS(U4CON1,0)
// U4CON2<U4STP0>
extern volatile __bit                   U4STP0              __at(0x1734);	// @ (0x2E6 * 8 + 4)
#define                                 U4STP0_bit          _BIT_ACCESS(U4CON2,4)
// U4CON2<U4STP1>
extern volatile __bit                   U4STP1              __at(0x1735);	// @ (0x2E6 * 8 + 5)
#define                                 U4STP1_bit          _BIT_ACCESS(U4CON2,5)
// U4FIFO<U4STPMD>
extern volatile __bit                   U4STPMD             __at(0x174E);	// @ (0x2E9 * 8 + 6)
#define                                 U4STPMD_bit         _BIT_ACCESS(U4FIFO,6)
// U4FIFO<U4TXBE>
extern volatile __bit                   U4TXBE              __at(0x174D);	// @ (0x2E9 * 8 + 5)
#define                                 U4TXBE_bit          _BIT_ACCESS(U4FIFO,5)
// U4FIFO<U4TXBF>
extern volatile __bit                   U4TXBF              __at(0x174C);	// @ (0x2E9 * 8 + 4)
#define                                 U4TXBF_bit          _BIT_ACCESS(U4FIFO,4)
// U4ERRIE<U4TXCIE>
extern volatile __bit                   U4TXCIE             __at(0x1760);	// @ (0x2EC * 8 + 0)
#define                                 U4TXCIE_bit         _BIT_ACCESS(U4ERRIE,0)
// U4ERRIR<U4TXCIF>
extern volatile __bit                   U4TXCIF             __at(0x1758);	// @ (0x2EB * 8 + 0)
#define                                 U4TXCIF_bit         _BIT_ACCESS(U4ERRIR,0)
// U4CON0<U4TXEN>
extern volatile __bit                   U4TXEN              __at(0x1725);	// @ (0x2E4 * 8 + 5)
#define                                 U4TXEN_bit          _BIT_ACCESS(U4CON0,5)
// PIE12<U4TXIE>
extern volatile __bit                   U4TXIE              __at(0x2551);	// @ (0x4AA * 8 + 1)
#define                                 U4TXIE_bit          _BIT_ACCESS(PIE12,1)
// PIR12<U4TXIF>
extern volatile __bit                   U4TXIF              __at(0x25D1);	// @ (0x4BA * 8 + 1)
#define                                 U4TXIF_bit          _BIT_ACCESS(PIR12,1)
// IPR12<U4TXIP>
extern volatile __bit                   U4TXIP              __at(0x1B71);	// @ (0x36E * 8 + 1)
#define                                 U4TXIP_bit          _BIT_ACCESS(IPR12,1)
// U4ERRIE<U4TXMTIE>
extern volatile __bit                   U4TXMTIE            __at(0x1767);	// @ (0x2EC * 8 + 7)
#define                                 U4TXMTIE_bit        _BIT_ACCESS(U4ERRIE,7)
// U4ERRIR<U4TXMTIF>
extern volatile __bit                   U4TXMTIF            __at(0x175F);	// @ (0x2EB * 8 + 7)
#define                                 U4TXMTIF_bit        _BIT_ACCESS(U4ERRIR,7)
// U4CON2<U4TXPOL>
extern volatile __bit                   U4TXPOL             __at(0x1732);	// @ (0x2E6 * 8 + 2)
#define                                 U4TXPOL_bit         _BIT_ACCESS(U4CON2,2)
// U4FIFO<U4TXWRE>
extern volatile __bit                   U4TXWRE             __at(0x174F);	// @ (0x2E9 * 8 + 7)
#define                                 U4TXWRE_bit         _BIT_ACCESS(U4FIFO,7)
// U4CON1<U4WUE>
extern volatile __bit                   U4WUE               __at(0x172C);	// @ (0x2E5 * 8 + 4)
#define                                 U4WUE_bit           _BIT_ACCESS(U4CON1,4)
// U4UIR<U4WUIF>
extern volatile __bit                   U4WUIF              __at(0x1757);	// @ (0x2EA * 8 + 7)
#define                                 U4WUIF_bit          _BIT_ACCESS(U4UIR,7)
// U4FIFO<U4XON>
extern volatile __bit                   U4XON               __at(0x174A);	// @ (0x2E9 * 8 + 2)
#define                                 U4XON_bit           _BIT_ACCESS(U4FIFO,2)
// U5CON0<U5ABDEN>
extern volatile __bit                   U5ABDEN             __at(0x17BE);	// @ (0x2F7 * 8 + 6)
#define                                 U5ABDEN_bit         _BIT_ACCESS(U5CON0,6)
// U5UIR<U5ABDIE>
extern volatile __bit                   U5ABDIE             __at(0x17EA);	// @ (0x2FD * 8 + 2)
#define                                 U5ABDIE_bit         _BIT_ACCESS(U5UIR,2)
// U5UIR<U5ABDIF>
extern volatile __bit                   U5ABDIF             __at(0x17EE);	// @ (0x2FD * 8 + 6)
#define                                 U5ABDIF_bit         _BIT_ACCESS(U5UIR,6)
// U5ERRIE<U5ABDOVE>
extern volatile __bit                   U5ABDOVE            __at(0x17FD);	// @ (0x2FF * 8 + 5)
#define                                 U5ABDOVE_bit        _BIT_ACCESS(U5ERRIE,5)
// U5ERRIR<U5ABDOVF>
extern volatile __bit                   U5ABDOVF            __at(0x17F5);	// @ (0x2FE * 8 + 5)
#define                                 U5ABDOVF_bit        _BIT_ACCESS(U5ERRIR,5)
// U5CON0<U5BRGS>
extern volatile __bit                   U5BRGS              __at(0x17BF);	// @ (0x2F7 * 8 + 7)
#define                                 U5BRGS_bit          _BIT_ACCESS(U5CON0,7)
// U5CON1<U5BRKOVR>
extern volatile __bit                   U5BRKOVR            __at(0x17C1);	// @ (0x2F8 * 8 + 1)
#define                                 U5BRKOVR_bit        _BIT_ACCESS(U5CON1,1)
// U5ERRIE<U5CERIE>
extern volatile __bit                   U5CERIE             __at(0x17FC);	// @ (0x2FF * 8 + 4)
#define                                 U5CERIE_bit         _BIT_ACCESS(U5ERRIE,4)
// U5ERRIR<U5CERIF>
extern volatile __bit                   U5CERIF             __at(0x17F4);	// @ (0x2FE * 8 + 4)
#define                                 U5CERIF_bit         _BIT_ACCESS(U5ERRIR,4)
// U5CTSPPS<U5CTSPPS0>
extern volatile __bit                   U5CTSPPS0           __at(0x13D8);	// @ (0x27B * 8 + 0)
#define                                 U5CTSPPS0_bit       _BIT_ACCESS(U5CTSPPS,0)
// U5CTSPPS<U5CTSPPS1>
extern volatile __bit                   U5CTSPPS1           __at(0x13D9);	// @ (0x27B * 8 + 1)
#define                                 U5CTSPPS1_bit       _BIT_ACCESS(U5CTSPPS,1)
// U5CTSPPS<U5CTSPPS2>
extern volatile __bit                   U5CTSPPS2           __at(0x13DA);	// @ (0x27B * 8 + 2)
#define                                 U5CTSPPS2_bit       _BIT_ACCESS(U5CTSPPS,2)
// U5CTSPPS<U5CTSPPS3>
extern volatile __bit                   U5CTSPPS3           __at(0x13DB);	// @ (0x27B * 8 + 3)
#define                                 U5CTSPPS3_bit       _BIT_ACCESS(U5CTSPPS,3)
// U5CTSPPS<U5CTSPPS4>
extern volatile __bit                   U5CTSPPS4           __at(0x13DC);	// @ (0x27B * 8 + 4)
#define                                 U5CTSPPS4_bit       _BIT_ACCESS(U5CTSPPS,4)
// U5CTSPPS<U5CTSPPS5>
extern volatile __bit                   U5CTSPPS5           __at(0x13DD);	// @ (0x27B * 8 + 5)
#define                                 U5CTSPPS5_bit       _BIT_ACCESS(U5CTSPPS,5)
// PIE13<U5EIE>
extern volatile __bit                   U5EIE               __at(0x255A);	// @ (0x4AB * 8 + 2)
#define                                 U5EIE_bit           _BIT_ACCESS(PIE13,2)
// PIR13<U5EIF>
extern volatile __bit                   U5EIF               __at(0x25DA);	// @ (0x4BB * 8 + 2)
#define                                 U5EIF_bit           _BIT_ACCESS(PIR13,2)
// IPR13<U5EIP>
extern volatile __bit                   U5EIP               __at(0x1B7A);	// @ (0x36F * 8 + 2)
#define                                 U5EIP_bit           _BIT_ACCESS(IPR13,2)
// U5ERRIE<U5FERIE>
extern volatile __bit                   U5FERIE             __at(0x17FB);	// @ (0x2FF * 8 + 3)
#define                                 U5FERIE_bit         _BIT_ACCESS(U5ERRIE,3)
// U5ERRIR<U5FERIF>
extern volatile __bit                   U5FERIF             __at(0x17F3);	// @ (0x2FE * 8 + 3)
#define                                 U5FERIF_bit         _BIT_ACCESS(U5ERRIR,3)
// U5CON2<U5FLO0>
extern volatile __bit                   U5FLO0              __at(0x17C8);	// @ (0x2F9 * 8 + 0)
#define                                 U5FLO0_bit          _BIT_ACCESS(U5CON2,0)
// U5CON2<U5FLO1>
extern volatile __bit                   U5FLO1              __at(0x17C9);	// @ (0x2F9 * 8 + 1)
#define                                 U5FLO1_bit          _BIT_ACCESS(U5CON2,1)
// PIE13<U5IE>
extern volatile __bit                   U5IE                __at(0x255B);	// @ (0x4AB * 8 + 3)
#define                                 U5IE_bit            _BIT_ACCESS(PIE13,3)
// PIR13<U5IF>
extern volatile __bit                   U5IF                __at(0x25DB);	// @ (0x4BB * 8 + 3)
#define                                 U5IF_bit            _BIT_ACCESS(PIR13,3)
// IPR13<U5IP>
extern volatile __bit                   U5IP                __at(0x1B7B);	// @ (0x36F * 8 + 3)
#define                                 U5IP_bit            _BIT_ACCESS(IPR13,3)
// PMD6<U5MD>
extern volatile __bit                   U5MD                __at(0x337);	// @ (0x66 * 8 + 7)
#define                                 U5MD_bit            _BIT_ACCESS(PMD6,7)
// U5CON0<U5MODE0>
extern volatile __bit                   U5MODE0             __at(0x17B8);	// @ (0x2F7 * 8 + 0)
#define                                 U5MODE0_bit         _BIT_ACCESS(U5CON0,0)
// U5CON0<U5MODE1>
extern volatile __bit                   U5MODE1             __at(0x17B9);	// @ (0x2F7 * 8 + 1)
#define                                 U5MODE1_bit         _BIT_ACCESS(U5CON0,1)
// U5CON0<U5MODE2>
extern volatile __bit                   U5MODE2             __at(0x17BA);	// @ (0x2F7 * 8 + 2)
#define                                 U5MODE2_bit         _BIT_ACCESS(U5CON0,2)
// U5CON1<U5ON>
extern volatile __bit                   U5ON                __at(0x17C7);	// @ (0x2F8 * 8 + 7)
#define                                 U5ON_bit            _BIT_ACCESS(U5CON1,7)
// U5ERRIE<U5PERIE>
extern volatile __bit                   U5PERIE             __at(0x17FE);	// @ (0x2FF * 8 + 6)
#define                                 U5PERIE_bit         _BIT_ACCESS(U5ERRIE,6)
// U5ERRIR<U5PERIF>
extern volatile __bit                   U5PERIF             __at(0x17F6);	// @ (0x2FE * 8 + 6)
#define                                 U5PERIF_bit         _BIT_ACCESS(U5ERRIR,6)
// U5FIFO<U5RCIDL>
extern volatile __bit                   U5RCIDL             __at(0x17E3);	// @ (0x2FC * 8 + 3)
#define                                 U5RCIDL_bit         _BIT_ACCESS(U5FIFO,3)
// U5CON2<U5RUNOVF>
extern volatile __bit                   U5RUNOVF            __at(0x17CF);	// @ (0x2F9 * 8 + 7)
#define                                 U5RUNOVF_bit        _BIT_ACCESS(U5CON2,7)
// U5FIFO<U5RXBE>
extern volatile __bit                   U5RXBE              __at(0x17E1);	// @ (0x2FC * 8 + 1)
#define                                 U5RXBE_bit          _BIT_ACCESS(U5FIFO,1)
// U5FIFO<U5RXBF>
extern volatile __bit                   U5RXBF              __at(0x17E0);	// @ (0x2FC * 8 + 0)
#define                                 U5RXBF_bit          _BIT_ACCESS(U5FIFO,0)
// U5CON1<U5RXBIMD>
extern volatile __bit                   U5RXBIMD            __at(0x17C3);	// @ (0x2F8 * 8 + 3)
#define                                 U5RXBIMD_bit        _BIT_ACCESS(U5CON1,3)
// U5ERRIE<U5RXBKIE>
extern volatile __bit                   U5RXBKIE            __at(0x17FA);	// @ (0x2FF * 8 + 2)
#define                                 U5RXBKIE_bit        _BIT_ACCESS(U5ERRIE,2)
// U5ERRIR<U5RXBKIF>
extern volatile __bit                   U5RXBKIF            __at(0x17F2);	// @ (0x2FE * 8 + 2)
#define                                 U5RXBKIF_bit        _BIT_ACCESS(U5ERRIR,2)
// U5CON0<U5RXEN>
extern volatile __bit                   U5RXEN              __at(0x17BC);	// @ (0x2F7 * 8 + 4)
#define                                 U5RXEN_bit          _BIT_ACCESS(U5CON0,4)
// U5ERRIE<U5RXFOIE>
extern volatile __bit                   U5RXFOIE            __at(0x17F9);	// @ (0x2FF * 8 + 1)
#define                                 U5RXFOIE_bit        _BIT_ACCESS(U5ERRIE,1)
// U5ERRIR<U5RXFOIF>
extern volatile __bit                   U5RXFOIF            __at(0x17F1);	// @ (0x2FE * 8 + 1)
#define                                 U5RXFOIF_bit        _BIT_ACCESS(U5ERRIR,1)
// U5FIFO<U5RXIDL>
extern volatile __bit                   U5RXIDL             __at(0x17E3);	// @ (0x2FC * 8 + 3)
#define                                 U5RXIDL_bit         _BIT_ACCESS(U5FIFO,3)
// PIE13<U5RXIE>
extern volatile __bit                   U5RXIE              __at(0x2558);	// @ (0x4AB * 8 + 0)
#define                                 U5RXIE_bit          _BIT_ACCESS(PIE13,0)
// PIR13<U5RXIF>
extern volatile __bit                   U5RXIF              __at(0x25D8);	// @ (0x4BB * 8 + 0)
#define                                 U5RXIF_bit          _BIT_ACCESS(PIR13,0)
// IPR13<U5RXIP>
extern volatile __bit                   U5RXIP              __at(0x1B78);	// @ (0x36F * 8 + 0)
#define                                 U5RXIP_bit          _BIT_ACCESS(IPR13,0)
// U5CON2<U5RXPOL>
extern volatile __bit                   U5RXPOL             __at(0x17CE);	// @ (0x2F9 * 8 + 6)
#define                                 U5RXPOL_bit         _BIT_ACCESS(U5CON2,6)
// U5RXPPS<U5RXPPS0>
extern volatile __bit                   U5RXPPS0            __at(0x13D0);	// @ (0x27A * 8 + 0)
#define                                 U5RXPPS0_bit        _BIT_ACCESS(U5RXPPS,0)
// U5RXPPS<U5RXPPS1>
extern volatile __bit                   U5RXPPS1            __at(0x13D1);	// @ (0x27A * 8 + 1)
#define                                 U5RXPPS1_bit        _BIT_ACCESS(U5RXPPS,1)
// U5RXPPS<U5RXPPS2>
extern volatile __bit                   U5RXPPS2            __at(0x13D2);	// @ (0x27A * 8 + 2)
#define                                 U5RXPPS2_bit        _BIT_ACCESS(U5RXPPS,2)
// U5RXPPS<U5RXPPS3>
extern volatile __bit                   U5RXPPS3            __at(0x13D3);	// @ (0x27A * 8 + 3)
#define                                 U5RXPPS3_bit        _BIT_ACCESS(U5RXPPS,3)
// U5RXPPS<U5RXPPS4>
extern volatile __bit                   U5RXPPS4            __at(0x13D4);	// @ (0x27A * 8 + 4)
#define                                 U5RXPPS4_bit        _BIT_ACCESS(U5RXPPS,4)
// U5RXPPS<U5RXPPS5>
extern volatile __bit                   U5RXPPS5            __at(0x13D5);	// @ (0x27A * 8 + 5)
#define                                 U5RXPPS5_bit        _BIT_ACCESS(U5RXPPS,5)
// U5CON1<U5SENDB>
extern volatile __bit                   U5SENDB             __at(0x17C0);	// @ (0x2F8 * 8 + 0)
#define                                 U5SENDB_bit         _BIT_ACCESS(U5CON1,0)
// U5CON2<U5STP0>
extern volatile __bit                   U5STP0              __at(0x17CC);	// @ (0x2F9 * 8 + 4)
#define                                 U5STP0_bit          _BIT_ACCESS(U5CON2,4)
// U5CON2<U5STP1>
extern volatile __bit                   U5STP1              __at(0x17CD);	// @ (0x2F9 * 8 + 5)
#define                                 U5STP1_bit          _BIT_ACCESS(U5CON2,5)
// U5FIFO<U5STPMD>
extern volatile __bit                   U5STPMD             __at(0x17E6);	// @ (0x2FC * 8 + 6)
#define                                 U5STPMD_bit         _BIT_ACCESS(U5FIFO,6)
// U5FIFO<U5TXBE>
extern volatile __bit                   U5TXBE              __at(0x17E5);	// @ (0x2FC * 8 + 5)
#define                                 U5TXBE_bit          _BIT_ACCESS(U5FIFO,5)
// U5FIFO<U5TXBF>
extern volatile __bit                   U5TXBF              __at(0x17E4);	// @ (0x2FC * 8 + 4)
#define                                 U5TXBF_bit          _BIT_ACCESS(U5FIFO,4)
// U5ERRIE<U5TXCIE>
extern volatile __bit                   U5TXCIE             __at(0x17F8);	// @ (0x2FF * 8 + 0)
#define                                 U5TXCIE_bit         _BIT_ACCESS(U5ERRIE,0)
// U5ERRIR<U5TXCIF>
extern volatile __bit                   U5TXCIF             __at(0x17F0);	// @ (0x2FE * 8 + 0)
#define                                 U5TXCIF_bit         _BIT_ACCESS(U5ERRIR,0)
// U5CON0<U5TXEN>
extern volatile __bit                   U5TXEN              __at(0x17BD);	// @ (0x2F7 * 8 + 5)
#define                                 U5TXEN_bit          _BIT_ACCESS(U5CON0,5)
// PIE13<U5TXIE>
extern volatile __bit                   U5TXIE              __at(0x2559);	// @ (0x4AB * 8 + 1)
#define                                 U5TXIE_bit          _BIT_ACCESS(PIE13,1)
// PIR13<U5TXIF>
extern volatile __bit                   U5TXIF              __at(0x25D9);	// @ (0x4BB * 8 + 1)
#define                                 U5TXIF_bit          _BIT_ACCESS(PIR13,1)
// IPR13<U5TXIP>
extern volatile __bit                   U5TXIP              __at(0x1B79);	// @ (0x36F * 8 + 1)
#define                                 U5TXIP_bit          _BIT_ACCESS(IPR13,1)
// U5ERRIE<U5TXMTIE>
extern volatile __bit                   U5TXMTIE            __at(0x17FF);	// @ (0x2FF * 8 + 7)
#define                                 U5TXMTIE_bit        _BIT_ACCESS(U5ERRIE,7)
// U5ERRIR<U5TXMTIF>
extern volatile __bit                   U5TXMTIF            __at(0x17F7);	// @ (0x2FE * 8 + 7)
#define                                 U5TXMTIF_bit        _BIT_ACCESS(U5ERRIR,7)
// U5CON2<U5TXPOL>
extern volatile __bit                   U5TXPOL             __at(0x17CA);	// @ (0x2F9 * 8 + 2)
#define                                 U5TXPOL_bit         _BIT_ACCESS(U5CON2,2)
// U5FIFO<U5TXWRE>
extern volatile __bit                   U5TXWRE             __at(0x17E7);	// @ (0x2FC * 8 + 7)
